Revit 2026 API

# LightTypeGetLightTypeFromInstance Method

---

Creates a light type object from the given document and element ID

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LightType GetLightTypeFromInstance(
	Document document,
	ElementId instanceId
)
```
```vb
Public Shared Function GetLightTypeFromInstance (
	document As Document,
	instanceId As ElementId
) As LightType
```
```cpp
public:
static LightType^ GetLightTypeFromInstance(
	Document^ document,
	ElementId^ instanceId
)
```
```fsharp
static member GetLightTypeFromInstance :
        document : Document *
        instanceId : ElementId -> LightType
```

#### Parameters

document Document
     The document the instanceId is from
instanceId ElementId
     The ID of the light fixture instance

#### Return Value

LightType The newly created LightType object

| Exception | Condition |
| --- | --- |
| ArgumentException | The ElementId is the argument that is being validated The ElementId is not valid because it is not for a light element. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace